%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% crc_poly.m                                                         
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Autor: Kevin Döring
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Date:
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Description:
% contains the generator polynomials for the crc calculation
%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Annex D Calculation of the CRC word

% contains the crc polynomials and initial contitions
% Indexing the polynomial: sCRC_poly(1).Gxx
% Indexing the initial state of crc: sCRC_poly(2).Gxx 

sCRC_poly = struct(...
    'G16' ,{[1 0 0 0 1 0 0 0 0 0 0 1 0 0 0 0 1] ones(1,16)},...
    'G8'  ,{[1 0 0 0 1 1 1 0 1] ones(1,8)},...
    'G6'  ,{[1 1 0 1 1 1 1] ones(1,6)},...
    'G5'  ,{[1 1 0 1 1 1] ones(1,5)},...
    'G3'  ,{[1 0 1 0] ones(1,3)},...
    'G2'  ,{[1 1 1] ones(1,2)},...
    'G1'  ,{[1 1] 1}...
);